{"Characters/Blackstaff-Tower":{"title":"Blackstaff Tower","links":["Characters/Grey-Hands"],"tags":[],"content":"The base of operations for the Grey Hands."},"Characters/Castle-Waterdeep":{"title":"Castle Waterdeep","links":["Characters/Reinar-Neverember"],"tags":[],"content":"Reinar Neverember, the current Open Lord’s home, and where he conducts his official business."},"Characters/Grey-Hands":{"title":"Grey Hands","links":["Characters/Blackstaff-Tower"],"tags":[],"content":"A.K.A. Force Grey\nThe Grey Hands are a group of elite adventurers, well versed in combat and magic. Their base of operations is Blackstaff Tower."},"Characters/Harpers":{"title":"Harpers","links":[],"tags":[],"content":""},"Characters/Ramalia-Haventree":{"title":"Ramalia Haventree","links":["Characters/Harpers"],"tags":[],"content":"Leader of the Harpers."},"Characters/Reinar-Neverember":{"title":"Reinar Neverember","links":[],"tags":["dnd/wdh","dnd/wcoc"],"content":"Links\n\nHistoric\n\nHis father, Dagult Neverember was the previous Open Lord , before embezzling funds from the city and being exiled.\nMember of the Harpers, quite senior\n"},"Characters/Vajra-Safahr":{"title":"Vajra Safahr","links":["Characters/Grey-Hands","Characters/Blackstaff-Tower"],"tags":[],"content":"Leader of the Grey Hands, based in Blackstaff Tower."},"Races/Bog":{"title":"Bog","links":[],"tags":[],"content":"Scratchpad\n\n2025-03-23"},"Races/Drow":{"title":"Drow","links":[],"tags":[],"content":"ForgottenRealms Description\n“Drow, also known as dark elves, deep elves, night elves, under-elves, and the Dark Ones among orcs, were a dark-skinned sub-race of elves that predominantly lived in the Underdark. They were hated and feared due to their cruelty, though some non-evil and an even smaller number of good drow existed.”\n\nG’not is not a fan of Drow, they enslaved him.\n"},"Races/Fae":{"title":"Fae","links":[],"tags":["dnd"],"content":"Fairy beings.\n\nFae Wild\n\nThis is a stub\nThe Fae Wild is a different plane/dimension/etc., where Fae originate. It’s possible to go between the Fae Wild and the normal world (what’s the normal world called?)\n\n\nCourts\nThe overlap between the Seelie and Unseelie courts is the chaos that Fae are known for.\nSeelie\n\nGenerally “good”.\nNothing monstrous, everything pretty/happy.\n\nUnseelie\n\nDark.\nNegative emotions, e.g. anger, etc.\n\n\nTypes\nBoggle\n\nAn extremely dumb and mischievous Fae.\n"},"Races/Goblin":{"title":"Goblin","links":["Races/Hobgoblin"],"tags":[],"content":"ForgottenRealms Description\n“Goblins were a race of small and numerous goblinoids common throughout Toril, often living in underground caverns near the surface known as lairs. The race was often, though not always, dominated by other goblinoids, most commonly Hobgoblins. Goblins may have, in fact, been initially created by this related race to serve as scouts and infiltrators.”"},"Races/Hag":{"title":"Hag","links":[],"tags":["dnd"],"content":"\nTypes\nDusk Hag\n\nIs very in tune with dream magic, feeds off nightmares.\nTends to have lots of minions to do its bidding.\nThe Dusk Hag is a powerful caster and is resistant to spells.\n"},"Races/Hobgoblin":{"title":"Hobgoblin","links":["Races/Goblin"],"tags":[],"content":"ForgottenRealms Description\n“Hobgoblins were larger, stronger, smarter, and more menacing forms of goblinoids than Goblins, but not as powerful as bugbears.”"},"Races/Humans":{"title":"Humans","links":[],"tags":[],"content":"ForgottenRealms Description\n“Humans on Toril were widespread, could be found in most regions and, in general, were fierce and disagreeable, which could sometimes lead certain other races to view them with contempt. They were renowned for their diversity and ambition, and although they lacked specialization, they could excel in many areas.”"},"Races/Nilbog":{"title":"Nilbog","links":["Races/Goblin"],"tags":[],"content":"ForgottenRealms Description\nNilbogs were Goblins possessed by trickster spirits, the result of a condition known as nilbogism. A possessed goblin was a prankster and impish creature, capable of affecting the behaviour of those surrounding it and of sowing chaos among its allies and enemies alike.\nCombat/Effects\n\nWhen anything bad is said to a Nilbog, the speaker is charmed.\n"},"Waterdeep_Chorus_of_Chaos/Unnamed-Organisation":{"title":"Unnamed Organisation","links":["Waterdeep_Chorus_of_Chaos/Waterdeep---Chorus-of-Chaos","Races/Fae"],"tags":["dnd/wcoc"],"content":"Links\n\nScratchpad\n\n2025-02-24\n\nIt seems these guys have something to do with the events of Fern’s Contract, and also Marcus Guildwell’s Contract - this coin, which Kal identified as being magical, was found on both scenes:\nThey seem to be ran, or at least have something significant to do with high-ranking Fae, more specifically the Unseelie Court. This was deduced from The Postmortem\n"},"Waterdeep_Chorus_of_Chaos/Waterdeep---Chorus-of-Chaos":{"title":"Waterdeep - Chorus of Chaos","links":["Waterdeep_Dragon_Heist/Waterdeep---Dragon-Heist","Characters/Reinar-Neverember","Races/Goblin","Races/Fae","Races/Humans","Characters/Grey-Hands","Races/Hobgoblin","Races/Nilbog","Characters/Blackstaff-Tower","Characters/Vajra-Safahr","Waterdeep_Chorus_of_Chaos/Waterdeep---Chorus-of-Chaos","Characters/Ramalia-Haventree","Characters/Castle-Waterdeep","Waterdeep_Chorus_of_Chaos/Waterdeep","Races/Drow","Races/Bog","Waterdeep_Chorus_of_Chaos/Unnamed-Organisation","Races/Hag","Redcaps"],"tags":["dnd/wcoc"],"content":"Links\n\nSetting\n\n1 year after the events of Waterdeep: Dragon Heist\nLeiral Silverhand has stepped down as the Open Lord as a result of our actions, Reinar Neverember has taken her place.\nThe Harpers (as Reinar is a high ranking official within the Harpers) are now in de-facto control of the city.\nReinar is aiming to abolish the City Watch, has massively cut them down and is more relying on gangs of adventurers.\nThis has made it harder for organised crime, as it is almost impossible to bribe/corrupt all of the small adventurer factions vs bribing the city watch, however smaller, one-off crimes have increased as civilians can’t easily report crimes (as it was with one large policing organisation).\nCosmo’s Inn is now the most popular pub in town (even surpassing the Yawning Portal) because the group’s so cracked.\n\n\n2025-03-04: “Fallen Kingdom”\nGideon’s Contract\n\nGideon Lestrade, a dragon who seems to be a fairly good/kind chap is housing a Goblin kingdom in his home.\nEverything was dandy until the king of the goblins, Chib, was overthrown in a coup.\nThis doesn’t work for Gideon, as this has thrown his house into chaos - the new king, Glib, has turned his courtyard into a barracks/training hall - he wants the previous peace (under Chib) restored.\nGlib has recently changed, he used to be quiet and he’s now much bolder, talking of fighting people and taking over the city.\nIt’s always been the same bunch of goblins in the kingdom, so not as if someone new has joined and whispered to Glib about overthrowing Chib - something else is at play.\n\nMinor Downtime\n\nKal asks his old boss from the watch, who is now a PI following the watch being disbanded, about the recent events where Fae are crossing over into the real world from the Fae Wild.\nHe learns:\n\nIt’s not just happening to the people we’ve encountered, it’s happening all over the city, and is being dealt with by other mercenary groups.\nIf there’s not a portal for the Fae to go through, they’ll need to be “pulled” through to the real world by someone on this plane. This would require very powerful magic, cast by someone either well versed in Fae magic or being helped by a high Fae, e.g. an Arch-Fae.\nEvery time the Fae are dispatched they turn back into Humans.\nYou can remove the Fae possession of its host by restraining the target and performing “Dispel Magic” using a certain ritual. The Grey Hands should know the ritual.\n\n\n\n”No worse way for a goblin to die”\n\nWe arrive at Gideon’s house, and are shown to the courtyard, where there are a handful of Goblins and Hobgoblins are training (there are archery targets set up, swords on the ground, etc.).\nWe speak to King Glib, and learn that he took over as Chib “cared not for expansion”. The rest of the goblins all simultaneously cheer for their new king.\nKhosu speak to Glib, and demonstrates that he is an excellent archer. King Glib immediately appoints Khosu as his general, putting him to work training the troops.\nPup speaks to Glib and with a smooth tongue becomes Glib’s advisor, but also notices that Glib is trying to charm him, and wards it off. He relays this information to the party.\nG’not asks one of the goblins standing around if he could see his hand, and the goblin complies, a bit confused - G’not then slips a Ring of Mind Shielding onto one of the goblin’s fingers, and the goblin’s demeanour instantly changes - Glib is charming the goblins.\nThe gang retreat from the courtyard and form a plan.\n\nThe Plan\n\nG’Not’s Ring of Mind Shielding somehow works to break the charm that the Glib has everyone under\nPup will perform a dance to distract Glib, allowing Khosu to “inspect his troops” and G’Not to quickly get the ring on and off all of the aforementioned troops.\n\nThe Execution\n\nThe Plan works a charm, and the goblins are all broken from Glib’s charm.\nThe gang burst into Glib’s “throneroom” and Pup casts a ridiculously overmatched sleep spell, instantaneously sending him to bed.\nThe now snoozing Glib is immediately tied up and gagged (Kal is never without his +1 magic ballgag)\nThe question “what should we do with him now” is floated, and Ar’gan is quick to an answer - lets pump him to death.\n\nThe Aftermath\n\nWe find on Glib a sceptre with a smiling goblin’s head on it, and Dante knows this to mean that someone is controlling Glib - a Nilbog - these creatures force everyone who speaks negatively of them to love them.\nWe take the bound Glib with us to Blackstaff Tower, and request an audience with Vajra Safahr, who isn’t best pleased that we brought with us a Nilbog, and as such performs the ritual to un-possess Glib rapidly.\n\nWhen a Goblin that a Nilbog is possessing has this ritual performed unto them, the Nilbog is banished back to the Fae Wild.\n\n\n\n”He Wears a Mask with a Smile”\n\nWe go to the theatre to see the famous show that’s in town, the same show that we found a ticket for on the criminals from Marcus’s Warehouse to see if we can gather any leads as to what’s going on with the string of possessions\nWe quickly percept as we are seated and notice three people: Ramalia Haventree (from the Harpers, she frequents the theatre, usually to meet with clients/informants), and two shifty looking fellows on both flanks of the theatre.\n\nCurtains Open\n\nThe show starts, and we learn that the troop will be playing a show for Reinar Neverember himself tomorrow at Castle Waterdeep (i.e. this is the penultimate time the troop will be playing in Waterdeep.\nThere are four members of the troop:\n\nThe Grand Maestro, who’s “talent” seems to be intense and impressive command of smoke, able to generate and manipulate thick, colourful smoke.\nA Drow, who is proficient in acrobatics and creates a clone of herself to dance with\nA blue Dragonborn with a lute, who can breathe out sparks and lightning, almost like fireworks.\nA small gnome-ish lady who plays a shawm while performing circus acrobatics.\n\n\n\nThe Encore\n\nThe two hooded men we noticed before the play began pull out coins, and crushing them they turn into Bogs.\nTwo people who happened to be sat behind the bogs are hit with the blast and are turned into frogs.\nKal listens closely to the song that the maestro is playing on the violin, and feels a rage building, he remembers that he has heard that song before, on the day when he killed her, and when he looks around the room, everyone he sees is her.\nWe’ll roll initiative next week.\n\n\n2025-02-24: “Warehouse Inspectors”\nFinishing Up Fern’s Contract\n\nAfter finishing up the fight from last session, we had an inspection around the cave, G’not licked one of the big mushrooms and found they get you high, causing hallucinations.\nThe high is quite peculiar in that the things that you hallucinate actually become real (these things could be good or bad). Kal recognised the mushrooms to be Johnnybloom Mushrooms.\nAfter rummaging in the guy (previously the Dusk Hag)‘s pockets, we find a journal:\n\nMiner’s Journal\n\nWritten within are several entries going back months, early entries are just talk of the mines, nothing particularly interesting, however it should be noted that there is no mention of all of the crystals or mushrooms, which do not belong in the cave.\nA few weeks later, the author begins writing about the mines closing: someone else has now been put in charge, and the mines are closing as they are unsafe for labour.\nThe author isn’t happy as this was his way of making a living, and believes the closure to be the fault of politicians, etc. (read: the upper echelons of society), who do not care about or act in his best interest.\nIn the final month’s worth of entries, he talks about an unnamed organisation that he has met with, who share in his belief.\nIn the final week’s worth, he writes about joining the organisation and stating that when the time is right, he’ll be given a mission.\nIn the last page of the journal, we find the emblem of the Unnamed Organisation.\n\nBack to Fern’s\n\nWe made our way back from the cave, and gave Fern the good news that his family would be safe moving forward.\nWe stayed the night at his, and in return for our help with the Fae problem, he gave us the 200gp and made us a fucking banging breakfast that was so good it gave us advantage on all wisdom checks for the entire day (we’re invited back for more whenever we like).\n\n”Vandal Problem”\n\nArriving in the warehouse, we find that everything is in working order. The warehouse is full, everything looks intact, or at the very least repaired.\nWe find in Marcus’s ledger that the expensive shipments of silks/fabrics are all in the back corner, however upon inspection the textiles are not very high quality, definitely not warranting the price tag.\nKal notices a floor plan in Marcus’s office and after some investigating, found that there’s a hidden room in the basement.\nUpon investigating where there should be a door, we notice a significant odour of gunpowder.\nKal suggests we see if there’s a gap in the ceiling such that we may be able to see into the room, and G’not finds a gap in the cobblestones above.\nInside the room there are many boxes (presumably filled with gunpowder/explosives), tools and workbenches, and around 10 creatures - which we later find out to be a particularly dumb and chaos/mischief loving variety of Fae.\nG’not incorrectly deduces that these creatures are the ones creating the gunpowder, and as such we figure that Marcus is running an illegal gunpowder manufacturing and selling operation, using the “expensive” textiles as a front.\nWe decide to go back and confront Marcus, as an assault on the room and the creatures within would almost certainly end in distaster, turning the city block where Marcus’s warehouse is located into a giant crater.\n\nConfronting Marcus\n\nMarcus confirms that he is a gunpowder smuggler, although doesn’t mention anything of the manufacturing, or the clients.\nHe is only the smuggler, he is paid to get the goods to their destination and not ask any questions.\nHe’s not heard anything for a week, but the big deal that he was anxious about (the reason we’re here), is in two days.\nWe decide to stake-out the warehouse, hoping to gather some intel on the higher ups of the gunpowder operation and hopefully work our way to the mastermind.\n\nThe “Stake-out”\n\nThe “stake-out” wasn’t really much of a stake-out. Just about as soon as we arrived we heard chaos in the warehouse. We got into vantage points on the surrounding roofs, allowing us to see into the courtyard.\nThis is where we figured out that these Fae creatures were in no way clever enough to be the ones crafting the gunpowder, and were in fact the very vandals that we were after. The creatures are called Boggles.\nThese creatures naturally secrete a flammable oil, leaving themselves covered in the oil and a trail behind them, wherever they walk. Unfortunately, they’re also so dumb that they don’t really understand how setting something on fire works, beyond the fact that they know “fire bad”. This means that while they’re not going to actively set themselves on fire, they’re also not going to actively avoid doing so.\nWe quickly put together that this could rapidly end in disaster - we’ve got walking fuses walking around waiting to light themselves, and enough gunpowder to level the city block in the basement.\nWe put together a plan:\n\nWe Give It Three Big Booms\n\nTaking advantage of their love of chaos, Pup’ll lure them out with a shatter centred in the courtyard - this spell creates a massive boom that can be heard for 300ft.\nOnce they’re in the courtyard, G’not will attempt to split them up with Prestidigitation, creating a sound of complete mayhem just outside the courtyard in the street.\nOnce they’re split up, we’ll spring from the rooftops and unleash on them.\nThe plan actually works spectacularly, Pup managed to lure every single one of them out into the courtyard, and G’not split almost half into the street.\nFrom there it was a quick cleanup, starting with Pup’s second shatter into the group of them crowded in the courtyard, followed by Kal swooping down and taking out two in the street, and the remaining being picked off by the rest of the group, with the final two killed with the third, and final, shatter.\n\nThe Postmortem\n\nAfter the fight, the Boggles turn back into regular men, who we find to be criminals - the criminals who were actually crafting the gunpowder.\nKal knows that Fae cannot usually go from the Fae Wild into a city, only into the woods.\nHe also knows that it’s almost unheard of for Fae to take over non-Fae beings - this is something that only higher Fae would be able to do, such as those who hold high positions in the Fae Courts (e.g. the Queen of the Fairies, Lord of The Green, or Arch-Fae).\nInspecting one of the criminals, we find the same coin, related to the Unnamed Organisation, as on the miner.\nWe also find a ticket to a theatre show that has already been, however it’s likely the theatre troop are still in town.\nIn the last few months the theatre troop have risen from anonymity to stardom - something fishy?\nThe theatre troop was invited to the city personally by Reinar himself.\nFinally, we send Marcus to jail for his involvement in the gunpowder scheme.\n\n\n2025-02-05: “First Day Back”\n\nGiven two contracts, both pretty urgent but one was threat to life, so we went for that first:\n\nFern’s Contract: “Someone Fucked Up My Horses”\n\nGiven to us by a guy described as: simple but honest, leaf/tree (druid?) looking guy, later found to be named Fern.\nHe owns a small successful ranch out of town\nAll 7 of his prize race-horses have been “ripped to shreds”, this happened when he was away putting his family within the city walls.\nDoesn’t bother anyone really, no suspects to go off of.\nOnly lead is that the entire family were having nightmares of smoky scenes with eyes and cackling in the fog.\nWent to Bookwyrm’s to see if he knows anything/has any ideas of the type of monster/spell/etc. as he’s quite the well read chap, puts us onto a type of monster, the “Dusk Hag”.\nThe Dusk Hag feeds off nightmares, is very in tune with dream magic, tends to have lots of minions to do its bidding. The Dusk Hag is a powerful caster and is resistant to spells.\nGet to the ranch and do some investigating, Argan smells fungus and Kal hears the magic trail, they’re able to follow their senses to the source\nThis leads us to a cave where we get into a fight with a bunch of Redcaps and one Dusk Hag (we got fucked up, fight didn’t conclude this session).\n\nMarcus Guildwell’s Contract: “Vandal Problem”\n\nMarcus Guildwell appears well dressed and groomed, upper class, quite well-to-do.\nHe runs a warehousing and shipping business, and recently it has been the target of vandals.\nNothing is stolen from what he can tell, however shelves are being knocked over, produce and goods smashed, ruined.\nWhenever they check the building they find no signs of forced entry.\nWhen we request access to his office, he does not want to grant us access however is persuaded and gives us a key.\nThis problem needs solved within the next three days, as he has a very valuable shipment leaving.\nHe will give us 500gp if the shipment and wares are fully intact.\n"},"Waterdeep_Chorus_of_Chaos/Waterdeep":{"title":"Waterdeep","links":[],"tags":[],"content":"One of the largest cities in the realm."},"Waterdeep_Dragon_Heist/Waterdeep---Dragon-Heist":{"title":"Waterdeep - Dragon Heist","links":["Characters/Reinar-Neverember"],"tags":["dnd/wdh"],"content":"Links\n\nSetting\n\nCity in slight chaos\nOrganised crime has a lot of power, able to corrupt a lot of the City Watch\nCurrent Open Lord is Leirel Silverhand\n\nStory\nWriting this after the story has concluded, so pinch of salt and a lot of shit missed (obv, will be added to retroactively).\nCity was in slight chaos;\n\nOrganised crime had a lot of power, able to corrupt a lot of the city watch\nReinar Neverember somewhat important at this time because he’s the son of an old “Open Lord”, Dagult Neverember. He comes to us with a quest to find his dad’s hidden loot, and thus the story kicks off\n"},"index":{"title":"Too. Much. DnD.","links":["Waterdeep_Chorus_of_Chaos/Waterdeep---Chorus-of-Chaos"],"tags":[],"content":"Current campaign: Waterdeep - Chorus of Chaos."}}